# this is a demo to get you more familiar with how to merge tabular data

In [2]:
import os
import sys
from functools import reduce
import pandas as pd
import numpy as np
sys.path.insert(0, '../../')
#from brickstudy import foundation

In [50]:

# initialize list of lists
data1 = [['frank', 11, 141,90,1.2], ['sushi', 15,123,90, 1.5],['juliette', 14,-156,87, 0.5], ['julie', 14,-156,87, 3.5], ['francine', 11, 141,-90, 5.5]]
 
# Create the pandas DataFrame
df1 = pd.DataFrame(data1, columns=['Name', 'Age', 'Systolic_BP', 'Diastolic_BP', 'some_ratio'])
df1

       Name  Age  Systolic_BP  Diastolic_BP  some_ratio
0     frank   11          141            90         1.2
1     sushi   15          123            90         1.5
2  juliette   14         -156            87         0.5
3     julie   14         -156            87         3.5
4  francine   11          141           -90         5.5

In [51]:
## Filtering away to columns with  see values below zero

In [59]:
df1[(df1.select_dtypes('number') >= -156).all(1)]

       Name  Age  Systolic_BP  Diastolic_BP  some_ratio
0     frank   11          141            90         1.2
1     sushi   15          123            90         1.5
2  juliette   14         -156            87         0.5
3     julie   14         -156            87         3.5
4  francine   11          141           -90         5.5

## make a function for that

In [63]:
def show_neg_value_patients(df, cutoff_number=0):
    "this function returns dataframes below  and including, and above a cutoff"
    below_rows = df[~(df.select_dtypes('number') >= cutoff_number).all(1)] 
    above_rows = df[(df.select_dtypes('number') >= cutoff_number).all(1)] 
    return above_rows, below_rows

In [62]:
p = show_neg_value_patients(df1, 0)
p[1]

       Name  Age  Systolic_BP  Diastolic_BP  some_ratio
2  juliette   14         -156            87         0.5
3     julie   14         -156            87         3.5
4  francine   11          141           -90         5.5